
#По номеру месяца выдать название знаков Зодиака, приходящихся на
#данный месяц (например, май: Телец и Близнецы).
# var 8, islamov, lab 7 slovari

dnum= dict([(1,"Козерог и Водолей"),
          (2,"Водолей и Рыбы"),
          (3,"Рыбы и Овен"),
          (4,"Овен и Телец"),
          (5,"Телец и Близнецы"),
          (6,"Близнецы и Рак"),
          (7,"Рак и Лев"),
          (8,"Лев и Дева"),
          (9,"Дева и Весы"),
          (10,"Весы и Скорпион"),
          (11,"Скорпион и Стрелец" ),
          (12,"Стрелец и Козерог" )])
dname = dict([(1, 'январе'), 
          (2, 'феврале'), 
          (3, 'марте'), 
          (4, 'апреле'), 
          (5, 'мае'), 
          (6, 'июне'), 
          (7, 'июле'), 
          (8, 'августе'), 
          (9, 'сентябре'), 
          (10, 'октябре'), 
          (11, 'ноябре'), 
          (12, 'декабре')])
i = int(input("Введите номер месяца: "))
print(f"Знак зодиака {dname.get(i)} = {dnum.get(i)}")